# top_idx = combined_scores.argsort()[::-1]
'''
获取 combined_scores 中分数从高到低排列后的排序索引
    argsort() 返回排序后的索引
    [::-1]   降序
    [:3]     取前3个切片
'''

import numpy as np

# 列表 --> 数组  【索引数组【0 1 2 3 4 5 6 7 8】
scores =  [0.00078102, 0.6844611, 0.11295923, 0.13353093, 0.10878262, 0.005914070, 0.11458926, 0.10642415, 0.12681826]

# 将Python列表 scores 转换为NumPy数组，并赋值给变量 scores_np
scores_np = np.array(scores)
# print(scores_np)
# [0.00078102 0.6844611  0.11295923 0.13353093 0.10878262 0.00591407 0.11458926 0.10642415 0.12681826]
# 索引数组【0 1 2 3 4 5 6 7 8】

# print(sorted(scores))  
# [0.00078102, 0.00591407, 0.10642415, 0.10878262, 0.11295923, 0.11458926, 0.12681826, 0.13353093, 0.6844611]
# 索引数组【0 5 7 4 2 6 8 3 1】

# argsort() --- argument sort
print(scores_np.argsort()[::-1][:3])
# 索引【1 3 8 6 2 4 7 5 0】
